In [21]:
import pandas as pd
import numpy as np
import json
from pandas.io.json import json_normalize

In [26]:
d = json.load(open('sb_assignments/data_wrangling_json/data/world_bank_projects.json'))

In [27]:
df = pd.read_json('sb_assignments/data_wrangling_json/data/world_bank_projects.json')

In [42]:
df2 = json_normalize(d,'mjtheme_namecode','countryshortname')

In [43]:
df2.head()

  code                                   name countryshortname
0    8                      Human development         Ethiopia
1   11                                                Ethiopia
2    1                    Economic management          Tunisia
3    6  Social protection and risk management          Tunisia
4    5                  Trade and integration           Tuvalu

In [44]:
d10= df2.sort_values('countryshortname')

In [45]:
d10.head()

     code                                      name countryshortname
1088   10                         Rural development      Afghanistan
851     2                  Public sector governance      Afghanistan
245     8                         Human development      Afghanistan
246     5                     Trade and integration      Afghanistan
247     4  Financial and private sector development      Afghanistan

In [46]:
d11 = d10.sort_values('code')

In [47]:
d11.head()

     code                 name                        countryshortname
212     1                                                      Liberia
2       1  Economic management                                 Tunisia
1218    1  Economic management                                   Tonga
1045    1  Economic management  Macedonia, former Yugoslav Republic of
363     1                                                Cote d'Ivoire

In [48]:
d12 = d11.sort_values('code')

In [49]:
grouped= d12.drop('name',axis=1).groupby('countryshortname').count()

In [50]:
grouped.sort_values(by='code',ascending=False).head(10)
# 1. 10 countries with the most projects, projects identified by code

                    code
countryshortname
Indonesia             56
India                 51
Vietnam               43
Bangladesh            41
Brazil                41
China                 40
Africa                39
Yemen, Republic of    34
Morocco               32
Mozambique            31

In [51]:
d12['code'].value_counts().head(10)
# 2a. top 10 major project themes by project 'code'

11    250
10    216
8     210
2     199
6     168
4     146
7     130
5      77
9      50
1      38
Name: code, dtype: int64

In [54]:
e = json.load(open('sb_assignments/data_wrangling_json/data/world_bank_projects.json'))
k = json_normalize(e,'mjtheme_namecode','countryshortname')

j = k.sort_values('name', na_position='first').set_index('code')['name'].to_dict()
k.loc[k['name'].str.strip() == '', 'name'] = k['code'].map(j)
print(k.head())
# 3. dataframe with the missing names filled in by 'code' index correspondence with 'name' value

  code                                          name countryshortname
0    8                             Human development         Ethiopia
1   11  Environment and natural resources management         Ethiopia
2    1                           Economic management          Tunisia
3    6         Social protection and risk management          Tunisia
4    5                         Trade and integration           Tuvalu

In [55]:
k['name'].value_counts().head(10)
# 2b. revisited -- top 10 major project themes by project 'name'

Environment and natural resources management    250
Rural development                               216
Human development                               210
Public sector governance                        199
Social protection and risk management           168
Financial and private sector development        146
Social dev/gender/inclusion                     130
Trade and integration                            77
Urban development                                50
Economic management                              38
Name: name, dtype: int64